In [1]:
import pandas

In [3]:
df = pandas.read_csv('quakes.csv')

In [7]:
df_schema = pandas.read_csv('schema.csv')

In [5]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [8]:
df_schema

      COLUMN                   ATTRIBUTE
0       YEAR       event Date: Year XXXX
1      MONTH      event Date: Month abbr
2        DAY             event Date: Day
3       HOUR  event Time (GMT): Hour 24h
4     MINUTE    event Time (GMT): Minute
5     SECOND    event Time (GMT): Second
6   LATITUDE          event Latitude (N)
7  LONGITUDE         event Longitude (E)
8      DEPTH            event Depth (km)
9  MAGNITUDE          event Magnitude Mr

# SORTING
we will sort by magnitude

In [9]:
df.sort_values(by='MAGNITUDE')

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
100614,2010,SEP,29,2,9,47.2,37.8600,23.0900,93,0.0
212820,2015,JUL,25,1,26,10.6,38.3800,21.9400,10,0.0
307732,2021,JAN,21,6,1,50.6,38.3748,22.0290,6,0.1
169539,2013,DEC,16,1,35,32.3,38.3500,22.1400,10,0.1
299585,2020,JUL,30,0,33,13.3,38.4023,21.9987,7,0.1
...,...,...,...,...,...,...,...,...,...,...
264559,2018,OCT,25,22,54,50.5,37.3516,20.4922,13,6.6
303157,2020,OCT,30,11,51,24.4,37.9001,26.8167,12,6.7
656,1968,FEB,19,22,45,39.0,39.5000,24.8000,10,6.7
7279,1979,APR,15,6,19,42.0,42.0000,19.0000,10,6.8
13,1964,OCT,6,14,31,22.0,39.7500,28.0000,10,7.0

In [10]:
df.sort_values(by='MAGNITUDE', ascending=False)

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
13,1964,OCT,6,14,31,22.0,39.7500,28.0000,10,7.0
7279,1979,APR,15,6,19,42.0,42.0000,19.0000,10,6.8
303157,2020,OCT,30,11,51,24.4,37.9001,26.8167,12,6.7
656,1968,FEB,19,22,45,39.0,39.5000,24.8000,10,6.7
12112,1983,AUG,6,15,43,53.3,40.0800,24.8100,22,6.6
...,...,...,...,...,...,...,...,...,...,...
226630,2016,APR,2,11,41,36.6,38.7200,20.5800,7,0.1
244909,2017,APR,26,20,52,48.8,38.3400,21.9960,11,0.1
140364,2012,SEP,19,2,13,44.9,38.3000,22.0600,10,0.1
212820,2015,JUL,25,1,26,10.6,38.3800,21.9400,10,0.0
100614,2010,SEP,29,2,9,47.2,37.8600,23.0900,93,0.0

first by magnitude descending and then by depth ascending (the biggest quakes first)

In [12]:
df.sort_values(by=['MAGNITUDE', 'DEPTH'], ascending=[False, True])

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
13,1964,OCT,6,14,31,22.0,39.7500,28.0000,10,7.0
7279,1979,APR,15,6,19,42.0,42.0000,19.0000,10,6.8
656,1968,FEB,19,22,45,39.0,39.5000,24.8000,10,6.7
303157,2020,OCT,30,11,51,24.4,37.9001,26.8167,12,6.7
587,1967,NOV,30,7,23,49.0,41.4000,20.5000,10,6.6
...,...,...,...,...,...,...,...,...,...,...
265309,2018,NOV,1,2,38,56.1,41.0893,23.9815,10,0.1
244909,2017,APR,26,20,52,48.8,38.3400,21.9960,11,0.1
128884,2012,MAR,24,16,19,4.2,38.3200,22.0200,14,0.1
212820,2015,JUL,25,1,26,10.6,38.3800,21.9400,10,0.0
100614,2010,SEP,29,2,9,47.2,37.8600,23.0900,93,0.0

In [34]:
df.sort_values(by='MAGNITUDE', ascending=False, inplace=True)

In [35]:
df.head()

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
13,1964,OCT,6,14,31,22.0,39.7500,28.0000,10,7.0
7279,1979,APR,15,6,19,42.0,42.0000,19.0000,10,6.8
303157,2020,OCT,30,11,51,24.4,37.9001,26.8167,12,6.7
656,1968,FEB,19,22,45,39.0,39.5000,24.8000,10,6.7
12112,1983,AUG,6,15,43,53.3,40.0800,24.8100,22,6.6

In [36]:
df[['DEPTH', 'MAGNITUDE']]

        DEPTH  MAGNITUDE
13         10        7.0
7279       10        6.8
303157     12        6.7
656        10        6.7
12112      22        6.6
...       ...        ...
226630      7        0.1
244909     11        0.1
140364     10        0.1
212820     10        0.0
100614     93        0.0

[313400 rows x 2 columns]

In [39]:
df.sort_values(by=['MAGNITUDE','DEPTH'], ascending=[False,True], inplace=True)

In [40]:
df.head(50)

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
13,1964,OCT,6,14,31,22.0,39.7500,28.0000,10,7.0
7279,1979,APR,15,6,19,42.0,42.0000,19.0000,10,6.8
656,1968,FEB,19,22,45,39.0,39.5000,24.8000,10,6.7
303157,2020,OCT,30,11,51,24.4,37.9001,26.8167,12,6.7
1434,1969,MAR,28,1,48,28.0,38.6000,28.5000,10,6.6
587,1967,NOV,30,7,23,49.0,41.4000,20.5000,10,6.6
264559,2018,OCT,25,22,54,50.5,37.3516,20.4922,13,6.6
12112,1983,AUG,6,15,43,53.3,40.0800,24.8100,22,6.6
70357,2008,JUN,8,12,25,27.9,37.9800,21.5100,25,6.5
10059,1982,JAN,18,19,27,23.0,39.9000,24.5000,10,6.4
55505,2006,JAN,8,11,34,54.0,36.2100,23.4100,69,6.4
8566,1981,FEB,24,20,53,36.0,38.1400,23.0000,10,6.3
9798,1981,DEC,19,14,10,49.0,39.2000,25.3000,10,6.3
183047,2014,MAY,24,9,25,1.0,40.2900,25.4000,28,6.3
11187,1983,JAN,17,12,41,30.9,37.9700,20.2500,9,6.2
248511,2017,JUL,20,22,31,11.7,36.9643,27.4332,10,6.2
67244,2008,FEB,14,10,9,23.4,36.5000,21.7800,41,6.2
71499,2008,JUL,15,3,26,34.5,35.8500,27.9200,56,6.2
108086,2011,APR,1,13,29,10.5,35.6400,26.5600,63,6.2
165455,2013,OCT,12,13,11,53.0,35.5000,23.2800,65,6.2
30005,1997,NOV,18,13,7,36.9,37.2600,20.4900,5,6.1
1276,1968,DEC,5,7,52,5.0,36.6000,27.1000,10,6.1
246613,2017,JUN,12,12,28,38.2,38.8388,26.3623,12,6.1
205228,2015,APR,16,18,7,44.9,35.2300,26.8200,37,6.1
67271,2008,FEB,14,12,8,55.2,36.2200,21.7500,38,6.1
26896,1996,JUL,20,0,0,39.8,36.1100,27.5200,38,6.1
23470,1995,MAY,13,8,47,17.0,40.1800,21.7100,39,6.1
2978,1972,MAY,4,21,40,5.0,35.3000,23.6000,50,6.1
289059,2019,NOV,27,7,23,42.7,35.6854,23.2599,71,6.1
66776,2008,JAN,6,5,14,19.3,37.1100,22.7800,86,6.1
41186,2002,JAN,22,4,53,54.3,35.5600,26.7300,104,6.1
309901,2021,MAR,3,10,16,8.3,39.7591,22.2102,8,6.0
295087,2020,MAY,2,12,51,9.2,34.4366,25.6915,9,6.0
1323,1969,JAN,14,23,12,9.0,36.2000,28.9000,10,6.0
274,1966,SEP,1,14,22,57.0,37.5000,22.3000,10,6.0
7959,1980,JUL,9,2,11,54.0,39.2000,23.9000,10,6.0
9948,1981,DEC,27,17,39,12.0,38.9000,24.9000,10,6.0
297,1966,OCT,29,2,39,25.8,38.8000,21.0000,10,6.0
218527,2015,NOV,17,7,10,7.3,38.6700,20.6000,11,6.0
46880,2004,MAR,17,5,20,58.2,34.4600,23.2600,24,6.0
67461,2008,FEB,20,18,27,4.9,36.1800,21.7200,25,6.0
6905,1978,JUN,20,20,3,21.0,40.8000,23.3000,33,6.0
22568,1994,SEP,1,16,12,41.6,41.1500,21.2600,5,5.9
310145,2021,MAR,4,18,38,19.1,39.7993,22.1260,5,5.9
101,1965,DEC,20,0,8,11.6,40.1000,24.8000,10,5.9
129,1966,FEB,5,2,1,42.8,39.1000,21.6000,10,5.9
6501,1977,SEP,11,23,19,22.0,35.0000,23.1000,10,5.9
286109,2019,SEP,21,14,4,24.7,41.4375,19.4087,10,5.9
16,1964,OCT,17,9,50,27.0,35.0000,25.5000,10,5.9
8610,1981,FEB,25,2,35,50.0,38.2000,23.0000,10,5.9

how to see largest and smallest values:

In [46]:
df['MAGNITUDE'].nlargest(10)

13        7.0
7279      6.8
656       6.7
303157    6.7
1434      6.6
587       6.6
264559    6.6
12112     6.6
70357     6.5
10059     6.4
Name: MAGNITUDE, dtype: float64

In [47]:
df.nlargest(10, 'MAGNITUDE')

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
13,1964,OCT,6,14,31,22.0,39.7500,28.0000,10,7.0
7279,1979,APR,15,6,19,42.0,42.0000,19.0000,10,6.8
656,1968,FEB,19,22,45,39.0,39.5000,24.8000,10,6.7
303157,2020,OCT,30,11,51,24.4,37.9001,26.8167,12,6.7
1434,1969,MAR,28,1,48,28.0,38.6000,28.5000,10,6.6
587,1967,NOV,30,7,23,49.0,41.4000,20.5000,10,6.6
264559,2018,OCT,25,22,54,50.5,37.3516,20.4922,13,6.6
12112,1983,AUG,6,15,43,53.3,40.0800,24.8100,22,6.6
70357,2008,JUN,8,12,25,27.9,37.9800,21.5100,25,6.5
10059,1982,JAN,18,19,27,23.0,39.9000,24.5000,10,6.4

In [48]:
df.nlargest(10, 'MAGNITUDE')[['MONTH', 'DAY']]

       MONTH  DAY
13       OCT    6
7279     APR   15
656      FEB   19
303157   OCT   30
1434     MAR   28
587      NOV   30
264559   OCT   25
12112    AUG    6
70357    JUN    8
10059    JAN   18